Revit API Introduction Labs
LabUtils.GetBottomAndTopLevels Method
 Determine bottom and top levels for creating walls. In a default empty Revit Architecture project, 'Level 1' and 'Level 2' will be returned.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public static bool GetBottomAndTopLevels(
	Document doc,
	ref Level levelBottom,
	ref Level levelTop
)
Visual Basic (Declaration)
Public Shared Function GetBottomAndTopLevels ( _
	doc As Document, _
	ByRef levelBottom As Level, _
	ByRef levelTop As Level _
) As Boolean
Visual C++
public:
static bool GetBottomAndTopLevels(
	Document^ doc,
	Level^% levelBottom,
	Level^% levelTop
)
Parameters
doc
Type: Document
levelBottom
Type: Level %
levelTop
Type: Level %
Return Value
True is the two levels are successfully determined.
See Also
LabUtils Class
Labs Namespace